Pandas

In [ ]:
abbreviation: Panel Data

In [7]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
import numpy as np
a=np.array([3,6,9,12])
seri=pd.Series(a)
seri

0     3
1     6
2     9
3    12
dtype: int32

In [6]:
seri[2:]

2     9
3    12
dtype: int32

In [8]:
dic={"apple":1,"banana":2,"pear":3}

In [9]:
seri=pd.Series(dic)

In [10]:
seri

apple     1
banana    2
pear      3
dtype: int64

In [ ]:
#fancy

In [11]:
seri[["pear"]]

pear    3
dtype: int64

In [ ]:
Pandas DataFrame

In [ ]:
note: numpy fix type but pandas multi type

In [13]:
import numpy as np
a=np.arange(1,10).reshape(3,3)
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [15]:
df=pd.DataFrame(a, columns=["vl1","vl2","vl3"])
df

   vl1  vl2  vl3
0    1    2    3
1    4    5    6
2    7    8    9

In [19]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [18]:
type(df.values)

numpy.ndarray

In [21]:
df.ndim

2

In [22]:
df.shape

(3, 3)

In [23]:
df.size

9

In [25]:
df.tail(1)

   vl1  vl2  vl3
2    7    8    9

In [26]:
df.head(1)

   vl1  vl2  vl3
0    1    2    3

In [7]:
import numpy as np
import pandas as pd
a=np.random.randint(10,size=6)
b=np.random.randint(10,size=6)
c=np.random.randint(10,size=6)
d=np.random.randint(10,size=6)


dic={"red":a,"blue":b,"green":c,"yellow":d}

df=pd.DataFrame(dic)
df

   red  blue  green  yellow
0    6     8      7       2
1    6     0      7       3
2    5     7      0       6
3    0     6      5       8
4    2     7      7       9
5    5     0      6       2

In [ ]:
#delete

In [9]:
df.drop("green",axis=1)

   red  blue  yellow
0    6     8       2
1    6     0       3
2    5     7       6
3    0     6       8
4    2     7       9
5    5     0       2

In [14]:
df.drop(3, axis=0)

   red  blue  green  yellow
0    6     8      7       2
1    6     0      7       3
2    5     7      0       6
4    2     7      7       9
5    5     0      6       2

In [15]:
df

   red  blue  green  yellow
0    6     8      7       2
1    6     0      7       3
2    5     7      0       6
3    0     6      5       8
4    2     7      7       9
5    5     0      6       2

In [16]:
df=df.drop(3, axis=0)

In [17]:
df

   red  blue  green  yellow
0    6     8      7       2
1    6     0      7       3
2    5     7      0       6
4    2     7      7       9
5    5     0      6       2

In [18]:
df.drop(2,axis=0,inplace=True) #deletes without reassignment

In [19]:
df

   red  blue  green  yellow
0    6     8      7       2
1    6     0      7       3
4    2     7      7       9
5    5     0      6       2

In [21]:
df["black"]=df["red"]*df["blue"]
df

   red  blue  green  yellow  black
0    6     8      7       2     48
1    6     0      7       3      0
4    2     7      7       9     14
5    5     0      6       2      0

loc and iloc

iloc normally indexing, 
loc function selects rows using row labels 
iloc function selects rows using their integer positions (staring from 0)

In [48]:
a=np.random.randint(10,size=(5,5))
df=pd.DataFrame(a,columns=["a1","a2","a3","a4","a5"])
df

   a1  a2  a3  a4  a5
0   6   4   2   0   4
1   8   6   3   9   5
2   4   7   9   2   7
3   8   9   8   6   8
4   0   2   8   3   0

In [44]:
#loc
df.loc[0]

a1    2
a2    0
a3    9
a4    9
a5    5
Name: 0, dtype: int32

In [45]:
#iloc
df.iloc[0]

a1    2
a2    0
a3    9
a4    9
a5    5
Name: 0, dtype: int32

In [46]:
df.loc[0:2]

   a1  a2  a3  a4  a5
0   2   0   9   9   5
1   4   2   4   6   1
2   0   8   9   0   5

In [47]:
df.iloc[0:2]

   a1  a2  a3  a4  a5
0   2   0   9   9   5
1   4   2   4   6   1

In [52]:
df[0:3][["a1","a2"]]#fancy

   a1  a2
0   6   4
1   8   6
2   4   7

In [56]:
df[(df.a1>4)][["a3","a4"]]

   a3  a4
0   2   0
1   3   9
3   8   6

In [58]:
df.loc[(df.a1>4),["a3","a4"]]

   a3  a4
0   2   0
1   3   9
3   8   6

In [61]:
df1=df+55
df1

   a1  a2  a3  a4  a5
0  61  59  57  55  59
1  63  61  58  64  60
2  59  62  64  57  62
3  63  64  63  61  63
4  55  57  63  58  55

In [62]:
pd.concat([df,df1])

   a1  a2  a3  a4  a5
0   6   4   2   0   4
1   8   6   3   9   5
2   4   7   9   2   7
3   8   9   8   6   8
4   0   2   8   3   0
0  61  59  57  55  59
1  63  61  58  64  60
2  59  62  64  57  62
3  63  64  63  61  63
4  55  57  63  58  55

In [63]:
pd.concat([df,df1], ignore_index=True)

   a1  a2  a3  a4  a5
0   6   4   2   0   4
1   8   6   3   9   5
2   4   7   9   2   7
3   8   9   8   6   8
4   0   2   8   3   0
5  61  59  57  55  59
6  63  61  58  64  60
7  59  62  64  57  62
8  63  64  63  61  63
9  55  57  63  58  55

In [64]:
import seaborn as sns
df=sns.load_dataset("planets")

In [66]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [67]:
df.shape

(1035, 6)

In [68]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [69]:
df["mass"].mean()

2.6381605847953233

In [70]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [71]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [74]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [78]:
import pandas as pd 
import seaborn as sns
titanic=sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [80]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [82]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [83]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447